#!/usr/bin/even python3
# -*- coding: utf-8 -*-


#====================================基础==================================

# 缩进问题
# Python使用缩进来组织代码块，请务必遵守约定俗成的习惯，坚持使用4个空格的缩进
# 在文本编辑器中，需要设置把Tab自动转换为4个空格，确保不混用Tab和空格。

# 注释
'''
注释块，其实这不是真正的注释，这是长文本表示法，可以赋给变量
'''

# 输出
print 'Hello'

# print()会依次打印每个字符串，遇到逗号“,”会输出一个空格
print("1", "2", "-3")

# 输入
name = input()
print name

#==================================变量====================================

# 变量
x = 1
x = "a"
print(x)


#===================================基本类型及其运算===================================

# 类型--整数
# Python可以处理任意大小的整数
x = 1
x = 100
x = -90
x = 0
x = 0xff00
x = 0xa223422bcdffffffffffffffffffffffffff  #14124188160282055902771733616080857577029631 
print(x)

# 类型--浮点
x = 1.24
x = -0.91
x = 1.23e9
x = 1.2e-5
print(x)

# 加减乘
x = 100
x = x + 1 #101
x = x - 1 #100
x = x * 2 # 200
x += 3  #203
x -= 1  #202
x *= 2  #404
print(x)

# 除法
# /除，结果永远是浮点数，即精确的除法
# //除，又叫地板除，结果永远是整数
x = 100 / 3  #33.333333333333336
print(x)  
x = 100 // 3  #33 
print(x)

# 取余
x = 100 % 3 #1
print(x)

# 类型--布尔
'''
支持and、or和not
'''
x = False
x = True
if x:
	print("是True")

if True or False:
	print("or：一个为True就是True")
	
if True and True:
	print("and: 两个为True才是True")

if not False:
	print('not: 取反')

# 空值
# None不能理解为0，因为0是有意义的，而None是一个特殊的空值
x = None
print(x)  #None

# 常量
# PI仍然是一个变量，Python根本没有任何机制保证PI不会被改变，所以，用全部大写的变量名表示常量只是一个习惯上的用法
PI = 3.1415926

#====================================字符串：基础==================================

	
# 类型--字符串
# 单引号'或双引号"括起来的任意文本
# 转义
'''
r''表示''内部的字符串默认不转义, \n输出就是\n。不是换行
\n表示换行，
\t表示制表符
\\表示的字符就是\
'''
# html实体

x = "I'm OK"
print(x)

x = 'I\'m \"OK\"!'
print(x)

x = r'\n'
print(x)



# 长文本，也支持r
x = '''哈哈哈哈哈
哈哈哈哈哈
哈哈哈哈哈1
1
2
3'''
print(x)

#======================================字符串：编码，ASCII和Unicode和UTF-8=================
# https://www.liaoxuefeng.com/wiki/0014316089557264a6b348958f449949df42a6d3a2e542c000/001431664106267f12e9bef7ee14cf6a8776a479bdec9b9000


#======================================字符串：格式化===========================
# 方式1
'''

%d	整数
%f	浮点数
%x	十六进制整数
格式化整数和浮点数还可以指定是否补0和整数与小数的位数

%s	字符串
如果你不太确定应该用什么，%s永远起作用，它会把任何数据类型转换为字符串
'''
print('%2d-%02d' % (3, 1))  #3-01 
print('%.2f' % 3.1415926)  #3.14 


#方式2
'Hello, {0}, 成绩提升了 {1:.1f}%'.format('小明', 17.125)


#====================================字符串：正则==================================



#=====================================运算符和表达式=================================





#=================================语句：判断，循环=====================================


# 判断
x = 100
if x > 1:
	print(x, "大于10")
else:
	print(x, "小于10")
	

	
	
#================================函数======================================




#================================元组，数组，集合，字典======================================



#=================================类和对象=====================================


#==================================错误和异常=====================================


#=================================namespace=====================================




#=================================类库=====================================





#=================================IO=====================================





#=================================进程和线程=====================================




#=================================http=====================================





#===============================数据库=======================================






#================================web框架======================================






#======================================================================

